[
    {
      "id": 25,
      "name": "Third Eye",
      "icon": "./img/25.png",
      "categoryId": 0,
      "category": "non_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "The pandemic has made travelling a thing of the past and isolation a new familiarity. Even then it is we who need to find the beauty amidst this strange routine.\nThird Eye, a photography contest held in memory of Vineeth Marar is a platform to showcase captures. So bring out the inner photographer, pick up the camera and capture the surprises of the new normal.",
      "format": "•  Event is live from 3rd January 2021 to 22nd January 2021. \n•  The theme of the competition is ISOLATION. \n•  The participants should send their entries via email to thirdeyemec@gmail.com.\n•  The results will be published in two categories :\n     1. Peoples' Choice\n     2. Judges' Choice\n\nWinning Criteria\n•  People’s Choice - The greatest number of likes on Instagram.\n•  Judges’ Choice - Solely based on the judges' judgement.\n\n",
      "rules": "•  A participant can send up to 3 entries, along with its respective captions and hashtags.\n•  All the entries should be in JPEG format, with an attachment of their EXIF files.\n•  Edited images will not be considered for evaluation (slight colour manipulations are permitted).\n•  The subject of the mail should be in the format - 'Name, College, Contact Number'.\n•  The entries must be submitted only to the designated mail-ID.\n•  Judges' decision shall be final and conclusive.\n",
      "venue": "Instagram",
      "day": 0,
      "datetime": "2021-01-28T19:00:00",
      "entryFee": 0,
      "prizeMoney": 6000,
      "eventHead1Id": 7,
      "eventHead1": {
        "id": 7,
        "name": "Cherian John",
        "email": "cherianjohn2010@gmail.com ",
        "phoneNumber": "+917559989966"
      },
      "eventHead2Id": 8,
      "eventHead2": {
        "id": 8,
        "name": "Ashwin Girish",
        "email": "ashwingirish01@gmail.com",
        "phoneNumber": "+919544262863"
      },
      "isTeam": false,
      "teamSize": null,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 0,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": null,
      "registrationEndDate": "2021-01-22T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [],
      "registration": null
    },
    {
      "id": 28,
      "name": "IBeTo Jr",
      "icon": "./img/28.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "IBeTo Junior 2020 (Innovations for a Better Tomorrow Junior) is an initiative of Excel 2020 aimed at unfolding technologically innovative ideas from 7th to 12th-grade school students.\nUnder efficient mentorship and with the provision of necessary tools and resources, the creative proposals can be contrived into a final product. This year, we hope to focus more on an idea pitching format with an introductory session that will help the virtual world of today.\n",
      "format": null,
      "rules": null,
      "venue": "Online",
      "day": 3,
      "datetime": "2021-01-31T10:00:00",
      "entryFee": 0,
      "prizeMoney": 10000,
      "eventHead1Id": 40,
      "eventHead1": {
        "id": 40,
        "name": "Anushka Anil",
        "email": "anushka.mec@gmail.com",
        "phoneNumber": "+918547377644"
      },
      "eventHead2Id": 41,
      "eventHead2": {
        "id": 41,
        "name": "Ayesha Hadeel",
        "email": "ayeshahadeel@gmail.com",
        "phoneNumber": "+917907299401"
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 0,
      "eventStatus": "yet_to_start",
      "numberOfRounds": 1,
      "currentRound": null,
      "needRegistration": false,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-14T12:00:00",
      "button": "Website",
      "registrationLink": "https://ibeto.netlify.app/#ibetojr",
      "rounds": [
        {
          "id": 17,
          "round": null,
          "day": 3,
          "datetime": "2021-01-31T10:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 6,
      "name": "Wave Cloning",
      "icon": "./img/6.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "        If analog circuits and designs are where you thrive, Wave Cloning is all for you. \n        Form a team of 3 and get ready to compete with some of the best circuit designing masterminds to showcase your skills and excellence in the field!\nAfter the preliminary round, your mission is to design circuits that replicate the given waveforms in the CROs, using only basic electronic elements. Build the required circuit and clear each round in the given time to proceed up the ranks and be the last team standing! ",
      "format": "      This will be an analog circuits-based event. Circuit analysis and various transfer characteristics are the areas being tested here. The contestants' designing and reasoning abilities on electronic circuits are tested in this time-bound challenge. The entire event will be following an interesting storyline.\n\nPlatforms: HackerEarth, Proteus.\n\nRound 1: Prelims (40 mins)\n•  The contestants will be tested in the field of basic electronic circuits. This will be a screening stage to sieve out the electronic masterminds and they will advance to next round. The top 10 teams qualify to round 2.\n\nRound 2:  Sprint \n•  The top ten teams from the prelims stage will take part in this. In this stage, the analytical and problem-solving skills of the teams are tested. A simple electronic circuit designing problem will be given. The first 6 teams to obtain the output will qualify to the next stage.\n\nRound 3:  Bug Hunter (1.5 hours)\n•  The shortlisted teams will have to identify and debug the given analog/digital circuit to get the desired output pattern on CRO within the stipulated time. The output of the debugged circuit will produce the correct wave pattern on the CRO. The first 4 teams to decode the message will advance to the finals.\n\nRound 4: Wave Cloning (1.5hours) \n•  In the final round, the task for the participants is to recreate a given wave pattern in DSO/CRO.\n•  The teams will be judged based on the perfection with which the wave is cloned and the time taken. \n•  The team that clones the wave most perfectly, within the given time, will win (if multiple teams clone the wave, then the first team to finish cloning will be considered).\n",
      "rules": "•  This will be a team event with each team having a maximum of 3 members.\n•  Inter-college teams are allowed.\n•  Decision of the coordinators will be final.\n•  Malpractices and sabotaging other teams in any form will lead to immediate disqualification.\n•   Organisers reserve the right to make decisions in cases of conflicts and other issues.\n•  Rules are subject to change at any point of time and it will be explained at the event as well.\n•  Teams violating the above rules will be disqualified immediately.\n•  Excel team will not bear responsibility for internet connection issues or delay caused by participants during the event. ",
      "venue": "Proteus",
      "day": 1,
      "datetime": "2021-01-29T16:30:00",
      "entryFee": null,
      "prizeMoney": 8000,
      "eventHead1Id": 19,
      "eventHead1": {
        "id": 19,
        "name": "Arjun Thejus ",
        "email": "arjunthejus.mec@gmail.com",
        "phoneNumber": "+91 96455 00926 "
      },
      "eventHead2Id": 20,
      "eventHead2": {
        "id": 20,
        "name": "Omar Bin Shafi ",
        "email": "omarbinshafi.mec@gmail.com",
        "phoneNumber": "+91 99616 77805 "
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 7,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-21T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 26,
          "round": "Sprint",
          "day": 1,
          "datetime": "2021-01-29T16:30:00"
        },
        {
          "id": 27,
          "round": "Bug Hunter",
          "day": 2,
          "datetime": "2021-01-30T10:30:00"
        },
        {
          "id": 28,
          "round": "Final Round",
          "day": 3,
          "datetime": "2021-01-31T10:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 37,
      "name": "Valorant ",
      "icon": "./img/37.png",
      "categoryId": 0,
      "category": "non_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "      Nail-biting bomb plants, hip fire headshots, and magical flicks of the wrist are the forte of Valorant. A single match from the makers of League of Legends developer Riot’s new 5v5 tactical hero shooter. \n\n      Equip the plethora of weapons and magical flicks and show them who is the boss.",
      "format": "• MAP POOL: [ Bind, Haven, Split, Ascent, and Icebox ]\n\n• Each team gets to ban 2 maps from the map pool in alternating order. The team that didn’t get the last ban gets to choose the side to play in the final unbanned map.\n\n• The rounds will be single elimination, except the finals which will be a best of three maps. (1 ban each)\n\n• Standard pro league format rules will be enforced.\n",
      "rules": "•  Standard Matchmaking format.\n•  Online game session.\n•  Number of rounds: 13 (Best of One map - voted by both teams)\n•  Maps(5):\n[Bind, Haven, Split, Ascent, Icebox]\n\n•  The maximum number of team members per team is FIVE - A squad can play with less but will not be provided any concession. \n\n•  The event will be controlled by an administrator who monitors the game server. The decision of the admin will be final and binding.\n\n•  Use of glitches as an advantage won’t be entertained.\n\n•  Players are allowed to edit in-game settings and sensitivity. \n\n•  Abuse of in-game communication channels is not entertained\n\n•  Matches are played based on standard rules.\n\n•  All the players have to join the discord server as specified when pinged, and be ready for their allotted time slots, with five minutes buffer.\n\n•  If a player disconnects, or there are issues with ping, each team has a chance to call a timeout once per half. A timeout will not last longer than 90 seconds.\n\n•  All the players have to join the discord server as specified.\n",
      "venue": "Online",
      "day": 3,
      "datetime": "2021-01-31T18:00:00",
      "entryFee": 250,
      "prizeMoney": 5000,
      "eventHead1Id": 14,
      "eventHead1": {
        "id": 14,
        "name": "Arpith S",
        "email": "arpiths@gmail.com",
        "phoneNumber": "+918157907349"
      },
      "eventHead2Id": 13,
      "eventHead2": {
        "id": 13,
        "name": "Albin Kottaram",
        "email": "albin@mec.ac.in",
        "phoneNumber": "+919446753540"
      },
      "isTeam": true,
      "teamSize": 5,
      "eventStatusId": 0,
      "eventStatus": "yet_to_start",
      "numberOfRounds": 1,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-28T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 22,
          "round": null,
          "day": 3,
          "datetime": "2021-01-31T18:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 33,
      "name": "Black Swan",
      "icon": "./img/33.png",
      "categoryId": 0,
      "category": "non_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "Black Swan was an online managerial event organized by Excel MEC in collaboration with IEDC MEC, wherein the participants put to test their analytical and decision-making skills.",
      "format": null,
      "rules": null,
      "venue": "Online",
      "day": 0,
      "datetime": "2020-06-21T17:00:00",
      "entryFee": null,
      "prizeMoney": 1000,
      "eventHead1Id": 47,
      "eventHead1": {
        "id": 47,
        "name": "Denil Geo Daise",
        "email": "denilgeodaise.mec@gmail.com",
        "phoneNumber": "+91 79023 94958"
      },
      "eventHead2Id": 48,
      "eventHead2": {
        "id": 48,
        "name": "Niranjana  ",
        "email": "niranjana.mec@gmail.com",
        "phoneNumber": "+91 75940 87087"
      },
      "isTeam": false,
      "teamSize": null,
      "eventStatusId": 2,
      "eventStatus": "finished",
      "numberOfRounds": 0,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": null,
      "registrationEndDate": "2020-06-20T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [],
      "registration": null
    },
    {
      "id": 32,
      "name": "Kryptos",
      "icon": "./img/32.png",
      "categoryId": 1,
      "category": "computer_science",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "     Finding your way through a series of clues, all a reference to something you must discover. Make the right connections, win the race against time, and only then in this hunt shall you find your prize.",
      "format": null,
      "rules": null,
      "venue": "Excel Play",
      "day": 0,
      "datetime": "2021-12-29T16:00:00",
      "entryFee": null,
      "prizeMoney": 6000,
      "eventHead1Id": 28,
      "eventHead1": {
        "id": 28,
        "name": "Aswin G",
        "email": "aswinganesh666@gmail.com",
        "phoneNumber": "+918089967282"
      },
      "eventHead2Id": 27,
      "eventHead2": {
        "id": 27,
        "name": "Afnan Navaz",
        "email": "afnannavaz@gmail.com",
        "phoneNumber": "+917994062437"
      },
      "isTeam": false,
      "teamSize": null,
      "eventStatusId": 2,
      "eventStatus": "finished",
      "numberOfRounds": 0,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": null,
      "registrationEndDate": "2021-01-10T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [],
      "registration": null
    },
    {
      "id": 10,
      "name": "MEC Labs",
      "icon": "./img/10.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "Ideate, learn and venture - build a team of four and find out-of-the-box solutions to society’s most imperative problems. You bring the zest to learn, and we bring the platform - complete with orientations, mentors, guides and more! Software or hardware, make your project stand out, and get a chance to win amazing prizes. \n\nExclusive to the students of MEC, don't miss the opportunity to work with the best minds on campus!",
      "format": "PHASE 1: Registration (Dec 22 - Dec 31)\n•  A team may consist of a maximum of 4 members. Only the team leader has to register and provide the details of individual team members and the area of interest.\n\nPHASE 2: Ideation \n•  All the teams would be provided with mentors from senior batches (third and fourth year). So the discussions regarding the finalization of topic selection can be carried out with the help of their assigned mentors. In the subsequent days, they will also be provided with a google slides template which can be filled as the project progresses.\n\nPHASE 3a: Design and Component list \n•  Based on the ideas and the instructions received from their mentors, teams can then start selecting the software, platforms, and/or the development boards required for their project. They can complete the algorithms, block diagrams as provided in their template, and finally make a list of components required for their projects which will be verified by their respective mentors.\n\nPHASE 3b (Hardware projects): Component Acquisition\n•  Mentors will guide each team to purchase the components through any online platform (Amazon, Thomson electronics, etc). Every member of a team is requested to purchase the components and development boards so that all the students can get hands-on experience in doing the project. If any cases of difficulty to avail the components arise, they may contact their mentors or event coordinators. Necessary arrangements will be made for the same.\n\nPHASE 4: Implementation\n•  Every team can start working on their project initially through simulation platforms like tinker cad, proteus, etc. (Workshop for the following will be conducted by Mixed Signals).\n•  After the components have been acquired, students can start working on their hardware and start building their projects.\n•  For Software projects, upload the code to GitHub/GitLab. Include a readme file describing how to run it and use it. For web-based projects, try to deploy it and add the URL in the readme. For mobile/desktop applications, add a build file in the git repository.\n\nPHASE 5: Presentation (February 4th week)\n•  The completed project will be presented in front of the judges by the team members.\n\n\n",
      "rules": "•  This will be a team event with each team having no more than 4 members.\n•  All members should be first and second year undergraduate from MEC.\n•  Decision of the coordinators will be final.\n•  Malpractices and sabotaging other teams in any form will lead to immediate\tdisqualification.\n•  Organizers reserve the right to make decisions in case of conflicts and other issues.\n•  Rules are subject to change at any point of time and it will be explained at the event as well.\n•  Teams violating the above rules will be disqualified immediately.",
      "venue": "Online",
      "day": 0,
      "datetime": "2021-02-28T16:00:00",
      "entryFee": 0,
      "prizeMoney": 10000,
      "eventHead1Id": 36,
      "eventHead1": {
        "id": 36,
        "name": "Hari Govind ",
        "email": "harigovindpk2000.mec@gmail.com",
        "phoneNumber": "+91 9400426744 "
      },
      "eventHead2Id": 37,
      "eventHead2": {
        "id": 37,
        "name": "Madhav ",
        "email": "madhav504.mec@gmail.com",
        "phoneNumber": "+91 8547764606 "
      },
      "isTeam": true,
      "teamSize": 4,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 0,
      "currentRound": null,
      "needRegistration": false,
      "registrationOpen": null,
      "registrationEndDate": "2020-12-31T00:00:00",
      "button": null,
      "registrationLink": null,
      "rounds": [],
      "registration": null
    },
    {
      "id": 38,
      "name": "Rocket League",
      "icon": "./img/38.png",
      "categoryId": 0,
      "category": "non_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "      Welcome to the high-powered hybrid of arcade-style soccer and vehicular mayhem! Rocket League lets you team up with your partner to tear up the tarmac and show your dribbling skills with fancy automobiles. Get indulged in nerve-wracking 5-minute mayhem competing against the city’s best in one of the most critically acclaimed game, score more and go home with up to 3k, and the respect of your adversaries!\n",
      "format": "• 2 vs 2 format\n• Match length: 5 minutes\n• Tournament Format: Knockout.\n•  Standard maps only.\n\n",
      "rules": "•  No restrictions on vehicles.\n•  No rehosting will be provided if a player disconnects after 30 seconds of match start or after a goal is scored. \n•  Each team has 5 minutes to connect to the invited private game. Failing to do so will result in disqualification. \n•  After the match, each team is requested to take a screenshot of the final screen as proof of match results. \n",
      "venue": "Online",
      "day": 2,
      "datetime": "2021-01-30T18:00:00",
      "entryFee": 100,
      "prizeMoney": 3000,
      "eventHead1Id": 14,
      "eventHead1": {
        "id": 14,
        "name": "Arpith S",
        "email": "arpiths@gmail.com",
        "phoneNumber": "+918157907349"
      },
      "eventHead2Id": 13,
      "eventHead2": {
        "id": 13,
        "name": "Albin Kottaram",
        "email": "albin@mec.ac.in",
        "phoneNumber": "+919446753540"
      },
      "isTeam": false,
      "teamSize": 2,
      "eventStatusId": 0,
      "eventStatus": "yet_to_start",
      "numberOfRounds": 1,
      "currentRound": null,
      "needRegistration": false,
      "registrationOpen": null,
      "registrationEndDate": "2021-01-28T23:59:00",
      "button": "Register",
      "registrationLink": "https://forms.gle/tmrmZFGYbXsfg9qq6",
      "rounds": [
        {
          "id": 23,
          "round": null,
          "day": 2,
          "datetime": "2021-01-30T18:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 39,
      "name": "Dalal Bull",
      "icon": "./img/39.png",
      "categoryId": 1,
      "category": "computer_science",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "      To buy, sell or wait - that is the question. Put to test your abilities to make calculated risks and make the best of your time with this challenging stock trading simulator.",
      "format": null,
      "rules": null,
      "venue": "Excel Play",
      "day": 0,
      "datetime": "2021-01-14T19:00:00",
      "entryFee": null,
      "prizeMoney": 6000,
      "eventHead1Id": 28,
      "eventHead1": {
        "id": 28,
        "name": "Aswin G",
        "email": "aswinganesh666@gmail.com",
        "phoneNumber": "+918089967282"
      },
      "eventHead2Id": 29,
      "eventHead2": {
        "id": 29,
        "name": "Rindish Krishna",
        "email": "rindishkrishna@gmail.com",
        "phoneNumber": "+918547861324"
      },
      "isTeam": false,
      "teamSize": null,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 0,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": null,
      "registrationEndDate": "2021-01-28T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [],
      "registration": null
    },
    {
      "id": 8,
      "name": "Defuse",
      "icon": "./img/8.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "     Got a steady hand and a mind that runs 10 folds under pressure? If so, we present to you Defuse. Challenge your knowledge in electronic circuits and defuse the bomb in this time-bound mission. After the preliminary round, clear each round to go up the ranks and defuse the bomb.\n\n     So, brush up on all your Digital Electronics lessons and sharpen your minds, for its time to put your mental and technical ability to the ultimate test.\n",
      "format": "Round 1: Prelims (30 minutes)\n•  Each team has to attend a set of questions based on Digital Electronics.\n\nRound 2: Designing (1.5 hours)\n•  The teams have to design and implement a digital circuit (in Proteus) using the given components to get the required output.\n\nRound 3: Debugging (1.5 hours)\n•  Shortlisted teams have to debug the given digital circuit to obtain a sequence which will lead them to the bomb.\n•  The first 5 teams to successfully finish this round will qualify to the final round.\n•  Platform: Proteus\n\nRound 4: Final (1 hour)\n•  The teams will have to defuse a live time bomb before time runs out.\n•  Platform: Proteus\n",
      "rules": "•  This will be a team event with each team having a maximum of 3 members.\n•  Inter-college teams are allowed.\n•  The decision of the coordinators will be final.\n•  Organisers reserve the right to make decisions in case of conflicts and other issues. \n•  Malpractices and sabotaging other teams in any form will lead to immediate disqualification. \n•  Rules are subject to change at any point of time and it will be explained at the event as well.\n•  Teams violating the above rules will be disqualified immediately.\n•  Excel team will not bear responsibility for internet connection issues or delays caused by participants during the event. \n",
      "venue": "Proteus",
      "day": 2,
      "datetime": "2021-01-30T08:30:00",
      "entryFee": null,
      "prizeMoney": 8000,
      "eventHead1Id": 21,
      "eventHead1": {
        "id": 21,
        "name": "Sharon Jerome ",
        "email": "sharonjerome.mec@gmail.com",
        "phoneNumber": "+91 80784 36685"
      },
      "eventHead2Id": 22,
      "eventHead2": {
        "id": 22,
        "name": "Yadukrishna N Kumar ",
        "email": "yadukrishna.mec@gmail.com",
        "phoneNumber": "+91 82813 37153 "
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 7,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-21T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 35,
          "round": "Designing Round",
          "day": 2,
          "datetime": "2021-01-30T08:30:00"
        },
        {
          "id": 36,
          "round": "Debugging Round",
          "day": 2,
          "datetime": "2021-01-30T14:00:00"
        },
        {
          "id": 37,
          "round": "Final Round",
          "day": 3,
          "datetime": "2021-01-31T14:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 36,
      "name": "CodeMenders",
      "icon": "./img/36.png",
      "categoryId": 1,
      "category": "computer_science",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "      Grab your tools and get ready to fix code as you compete against other teams in a battle to twist and turn lines and turn back the clock.\n      \n      Take your teamwork to the next level as you work together to weave through levels that put your thinking to the test. \n",
      "format": "•  A team event consisting of a series of different challenges with defined points.\n\n•  The event tests the participants' debugging and reverse engineering skills. \n\n•  The participants are required to find out bugs in a given source code and fix them. \n\n•  Given a result from a source code, the participants will try to reverse engineer the application source code.",
      "rules": "•  This will be a team event with each team having a maximum of 4 members.\n•  Inter-college teams are allowed.\n•  Decision of the coordinators will be final.\n•  Malpractices and sabotaging other teams in any form will lead to immediate disqualification.\n•  Organisers reserve the right to make decisions in cases of conflicts and other issues.\n•  Rules are subject to change at any point of time and it will be explained at the event as well.\n•  Teams violating the above rules will be disqualified immediately.\n•  Excel team will not bear responsibility for internet connection issues or delay caused by participants during the event. ",
      "venue": "HackerEarth",
      "day": 3,
      "datetime": "2021-01-31T09:30:00",
      "entryFee": null,
      "prizeMoney": 10000,
      "eventHead1Id": 34,
      "eventHead1": {
        "id": 34,
        "name": "Aswin M Prabhu",
        "email": "aswinmprabhu@gmail.com ",
        "phoneNumber": "+91 94974 93951"
      },
      "eventHead2Id": 33,
      "eventHead2": {
        "id": 33,
        "name": "Rahul R ",
        "email": "rahulrkn99@gmail.com ",
        "phoneNumber": "+91 95672 78096"
      },
      "isTeam": true,
      "teamSize": 4,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 3,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-24T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 21,
          "round": "Final Round",
          "day": 3,
          "datetime": "2021-01-31T09:30:00"
        }
      ],
      "registration": null
    },
    {
      "id": 2,
      "name": "DevCraft",
      "icon": "./img/2.png",
      "categoryId": 1,
      "category": "computer_science",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "     Grab your friends, team up and participate in this 24-hour long Design and Development Challenge, curated without restrictions for you to experiment with maximum creativity and let your inner innovator shine!\n\n     Welcoming web developers, mobile app developers, desktop app developers, (the ultimate crossover of developers, to be precise), DevCraft calls upon you all to come forward and weave magic out of your technical craft and develop applications that will blow our minds away.\n\n    Don’t miss this chance to work with true passion and unleash your vision! \n",
      "format": "•  In essence, DevCraft is a Design and Development Challenge, comprising of just one round. \n\n•  Each team will have to make a website/ mobile application/ desktop application.\n\n•  The application will be evaluated based on its functionality, UI and its UX. Extra points will be awarded if the team has multiple platforms to showcase their application. \n\n•  All submissions for the hackathon are to be made via GitHub.\n\n•  The content required in the submission are:\n1. The codebase of the application.\n\n2. A README file that contains information regarding how to run the application, a link to a remote url (if any exist), a link to a video of the working demo of the application, and a proper description of all the functionalities.\n\n3. An executable file if the application is built to run on desktop/mobile.\n",
      "rules": "•  Since it’s a UI - Hackathon, there are no official rules/restrictions so as to provide maximum creativity and flexibility in the applications created by our imaginative participants.\n•  However, we request you to rely on intuition and as always, the judges' ruling is final.\n•  Each team can consist of 3-5 members.",
      "venue": "Online",
      "day": 1,
      "datetime": "2021-01-29T17:00:00",
      "entryFee": null,
      "prizeMoney": 12000,
      "eventHead1Id": 32,
      "eventHead1": {
        "id": 32,
        "name": "Ameen Azeez ",
        "email": "ameen4455@gmail.com",
        "phoneNumber": " +91 96332 88284"
      },
      "eventHead2Id": 35,
      "eventHead2": {
        "id": 35,
        "name": "Priyanka P Kini ",
        "email": "priyangapkini99@gmail.com",
        "phoneNumber": "+91 80782 55743"
      },
      "isTeam": true,
      "teamSize": 5,
      "eventStatusId": 0,
      "eventStatus": "yet_to_start",
      "numberOfRounds": 2,
      "currentRound": 1,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-28T00:00:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 16,
          "round": null,
          "day": 1,
          "datetime": "2021-01-29T17:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 31,
      "name": "Game Plan",
      "icon": "./img/31.png",
      "categoryId": 0,
      "category": "non_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "Are you someone with a flair for all things managerial?\nWell, here's your chance to showcase it! GamePlan offers you the chance to build your football team and deploy your favourite Ferguson formula! So buckle up to take your team to glory in FIFA 20!\n",
      "format": "Round 1 (Preliminary Round)\n•  Prelims include a quiz consisting of objective questions. The platform for the quiz will be HackerEarth. \n•  One person from each group will be admitted to take part in this round. \n•  The top 10 teams will be shortlisted for the next round.  \n\nRound 2 (Intermediate Round 1)\n•  This is an audio and visual round conducted through a live meeting on google meet. \n•  The top 5 scorers will move on to the next round. \n•  The scores from the prelims will be considered in the event of a tie. \n \nRound 3  (Intermediate Round 2)\n•  The teams will have to auction for players to form a squad for the final round. \n•  Points are awarded based on the strength of the squad formed. \n•  3 teams will be shortlisted for the final round.\n\nRound 4 (Final Round)\n•  The squads of the top 3 shortlisted teams will be pitched against each other in a league format (FIFA 20). \n•  The team with the most points accumulated over the last 3 rounds will be declared as the winners of the event.\n\nPoints Weighting\n•  Rounds in the decreasing order of points weighting:\n   1. Round 3: INTERMEDIATE ROUND – 2 (Auction)\n   2. Round 4: FINAL ROUND (FIFA 20)\n   3. Round 2: INTERMEDIATE ROUND – 1 (Quiz)",
      "rules": "•  This is a team event.\n•  Teams can have 2 or 4 members.\n•  The contest is open to all age groups.\n•  Organisers reserve all rights to disqualify any team for using unfair means at any stage of the event.\n•  In case of any discrepancies, the decision of the coordinators shall be considered final and binding for all teams.\n•  Additional rules will be provided by the organizers on site.\n•  Any violation of the rules provided by the organizers will lead to immediate disqualification.\n",
      "venue": "HackerEarth",
      "day": 0,
      "datetime": "2021-01-25T16:30:00",
      "entryFee": 100,
      "prizeMoney": 5000,
      "eventHead1Id": 12,
      "eventHead1": {
        "id": 12,
        "name": "Gokul S Gopan",
        "email": "gokul2455.mec@gmail.com",
        "phoneNumber": "+919497543319"
      },
      "eventHead2Id": 11,
      "eventHead2": {
        "id": 11,
        "name": "Naveen N",
        "email": "naveennavi.mec@gmail.com",
        "phoneNumber": "+919446964305"
      },
      "isTeam": true,
      "teamSize": 4,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 6,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-25T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 18,
          "round": "Intermediate Round 1",
          "day": 1,
          "datetime": "2021-01-29T16:00:00"
        },
        {
          "id": 24,
          "round": "Intermediate Round 2",
          "day": 2,
          "datetime": "2021-01-30T13:30:00"
        },
        {
          "id": 25,
          "round": "Final Round",
          "day": 2,
          "datetime": "2021-01-30T16:30:00"
        }
      ],
      "registration": null
    },
    {
      "id": 7,
      "name": "Reverso",
      "icon": "./img/7.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "        Think that you are a circuit champion? Well here's your chance to show your prowess to the world! Reverso is a competition which requires the participants to reproduce another manufacturer's product after examining it thoroughly. The main objective of the event is to mould the participants to debug a circuit and build a working circuit from its parts.",
      "format": "Round 1\n•  MCQ Round focusing mainly on basic engineering concepts.\n•  Platform: HackerEarth\n\nRound 2 (Problem Identification and Solving Ability) \n•  Identify components from the given picture and debug simple codes.\n•  Platform: HackerEarth\n\nRound 3 (Product Study Round)\n•  Participants are required to study a complex product and make a complete description of it along with its block diagram.\n•  Platform: TinkerCad\n\nRound 4 (Debugging Round)\n•  A working model of a product will be provided with a small bug in it. Participants have to find this bug and the fastest to find it wins!\n•  Platform: TinkerCad\n",
      "rules": "•  Each team can have a maximum of 3 members.\n•  Participants should have a basic idea of Arduino Programming.\n•  Malpractices and sabotaging other teams in any form will lead to immediate disqualification. \n•  Rules are subject to change at any point in time. The final decision will be made by the organisers.\n•  Excel team will not bear responsibility for any internet connection issue or delay caused by participants during the event.\n",
      "venue": "TinkerCad",
      "day": 0,
      "datetime": "2021-01-24T17:00:00",
      "entryFee": null,
      "prizeMoney": 8000,
      "eventHead1Id": 17,
      "eventHead1": {
        "id": 17,
        "name": "Smrithi Shenoy ",
        "email": "smrithishenoy.mec@gmail.com",
        "phoneNumber": "+91 7034373374"
      },
      "eventHead2Id": 18,
      "eventHead2": {
        "id": 18,
        "name": "John T Biju ",
        "email": " johntbiju.mec@gmail.com",
        "phoneNumber": "+91 85474 69803"
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 6,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-21T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 33,
          "round": "Product Study Round",
          "day": 1,
          "datetime": "2021-01-29T17:30:00"
        },
        {
          "id": 34,
          "round": "Final Round",
          "day": 2,
          "datetime": "2021-01-30T12:30:00"
        }
      ],
      "registration": null
    },
    {
      "id": 3,
      "name": "Lifeline",
      "icon": "./img/3.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "          Lifeline is a biomedical based team event, testing your knowledge with an eclectic mix of both technical and non-technical rounds.\n         The event checks one's problem-solving ability ranging from quizzing to electronic circuits to presentation skills. There would be a preliminary round which comprises of an MCQ test that counts the basic knowledge of the team in a wide range of topics followed by a series of competitive rounds.\n          So what are you waiting for? Be ready to pick your team up and embellish your team spirit for a cause that no one else could.\n",
      "format": "•  The event has 3 rounds and 2 intermediate rounds.\n\nRound  1: Preliminary round\n•  This round will be conducted as a quiz through HackerEarth. The participants are only allowed to take the test from their laptop. The quiz revolves around a wide range of topics like basic electronics, biology, etc. The duration will be 1 hour.\n•  Platform: HackerEarth\n\nRound 2 Intermediate (Non-tech):\n•  This would be a non-tech round like logo guessing or game-based. The duration will be 1 hour.\n•  Platform: Google Meet\n\nRound 2:\n•  This would be an electronic circuits-based round with a  duration of 1 hour.\n•  Platform: Google Meet\n\nRound 3 Intermediate (Tech):\n •  In this round, the participants have to identify an electronic component or device that is distorted in some form. The duration of this round would be 1 hour.\n•  Platform: Google Meet\n\nRound 3: Finals\n•  In this, participants have to solve a real-world problem (e.g., lack of proper healthcare in rural areas) and do a presentation on the same. Each team will be given 10 minutes to present their idea.\n•  Platform: Google Meet\n\nImportant points:\n•  Participants are required to switch on their camera during every round.\n\n",
      "rules": "•  This will be a team event with each team having no more than 3 members.\n•  Intercollege teams are allowed.\n•  The decision of the coordinators will be final.\n•  Malpractices and sabotaging other teams’ in any form will lead to immediate disqualification.\n•  Organisers reserve the right to make decisions in case of conflicts and other issues.\n•  Rules are subject to change at any point of time and it will be explained at the event as well.\n•  Teams violating the above rules will be disqualified immediately.\n•  Excel team will not bear responsibility for internet connection issues or delay caused by participants during the event. \n",
      "venue": "Google Meet",
      "day": 0,
      "datetime": "2021-01-26T16:30:00",
      "entryFee": null,
      "prizeMoney": 6000,
      "eventHead1Id": 23,
      "eventHead1": {
        "id": 23,
        "name": "Gayathri R ",
        "email": "gayathrir.mec@gmail.com",
        "phoneNumber": "+91 70257 88613 "
      },
      "eventHead2Id": 24,
      "eventHead2": {
        "id": 24,
        "name": "Arun Joseph ",
        "email": "arunjoseph.mec@gmail.com",
        "phoneNumber": "+91 81369 14865 "
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 4,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-21T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 29,
          "round": "Final Round",
          "day": 1,
          "datetime": "2021-01-29T18:30:00"
        }
      ],
      "registration": null
    },
    {
      "id": 4,
      "name": "Lumiere",
      "icon": "./img/4.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "     Think you have the wires in you to connect your way to success? Well then, you’re at the right place where your circuit wiring skills will be put to the test. Design the most efficient circuit in the least amount of time in order to attain the sparkling victory you have always been yearning for. Tick-Tock! Don't let the time run out.",
      "format": "The event comprises of four rounds.\n\nRound 1: Prelims\n•  An objective type quiz is to be completed.  \n•  8 teams will be shortlisted to the next round.\n•  Platform: HackerEarth\n\nRound 2: Quiz Round\n•  This round will be conducted via Google Meet.\n•  Time will be allotted to the groups for discussing the solutions for the questions.\n•  6 teams will be shortlisted to the next round.\n\nRound 3: Circuit Analysis\n•  Solving an electrical circuit in a given span of time.\n•  First 4 teams will be selected for the finals.\n•  Platform: TinkerCad\n\nRound 4: Finals\n•  Similar format as that of Round 3.\n•  Complex Circuit has to be solved.\n•  The first team to solve wins!\n•  Platform: TinkerCad\n",
      "rules": "•  Team Event - Maximum of 3 members per team.\n•  Laptop/PC with Webcam is compulsory.\n•  Organiser reserves the right to take the final decision in case of disputes if any.\n•  All the rounds will be recorded.\n•  Any form of malpractice is strictly discouraged and can lead to immediate disqualification of the team.\n•  Judges' decision shall be final.\n",
      "venue": "TinkerCad",
      "day": 0,
      "datetime": "2021-01-26T16:30:00",
      "entryFee": null,
      "prizeMoney": 6000,
      "eventHead1Id": 9,
      "eventHead1": {
        "id": 9,
        "name": "Karun Raj ",
        "email": "karunraj.mec@gmail.com",
        "phoneNumber": "+91 80755 12304"
      },
      "eventHead2Id": 10,
      "eventHead2": {
        "id": 10,
        "name": "Jameel Rayhaan Rafeeque",
        "email": "jameelrayhaan.mec@gmail.com",
        "phoneNumber": "+91 82899 78903"
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 5,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-21T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 30,
          "round": "Final Round",
          "day": 2,
          "datetime": "2021-01-30T18:30:00"
        }
      ],
      "registration": null
    },
    {
      "id": 12,
      "name": "Lord of Code",
      "icon": "./img/12.png",
      "categoryId": 1,
      "category": "computer_science",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "        If you're one of those people who love solving problems while you code, this one's for you!  \nA platform to show off your competitive coding skills. Orchestrate a symphony of code as you strike the right chords of 1's and 0's, competing to find the best solution in the fastest time! \n",
      "format": "•  A competitive coding event that tests coding skills, programming logic and problem-solving ability. \n•  The event will be an individual event and will be held on HackerRank.\n•  It will consist of 2 rounds, with questions of progressively increasing difficulty.\n•  The Prelims will be held on 23/1/2021, the round will be of duration- 1.5 hours.\n•  The Final event will be held on 30/1/2021, the round will be of duration- 2.5 hours.\n",
      "rules": "•  Refrain from discussing strategy during the contest. \n\n•  All submissions are run through a plagiarism detector. Any case of code plagiarism will disqualify both users from the contest. \n\n•  HackerRank admin decisions are final.\n\n•  Each challenge has a pre-determined score. Your score for a problem depends on the number of test cases your submission successfully passes. \n\n•  A participant's total score is the sum of the scores earned for each problem attempted. If you submitted more than one solution for a problem, only your highest score achieved will be used in this calculation.\n\n•  Participants are ranked by score, with the cumulative time taken (between the contest's start time and the time of your correct submission) used to break ties.\n\n",
      "venue": "Excel Play",
      "day": 2,
      "datetime": "2021-01-30T10:00:00",
      "entryFee": null,
      "prizeMoney": 8000,
      "eventHead1Id": 30,
      "eventHead1": {
        "id": 30,
        "name": "C G Giridhar ",
        "email": "giridharcg.mec@gmail.com",
        "phoneNumber": "+919746005577 "
      },
      "eventHead2Id": 31,
      "eventHead2": {
        "id": 31,
        "name": "Megha K C",
        "email": "meghakc.mec@gmail.com",
        "phoneNumber": "+918078906366 "
      },
      "isTeam": false,
      "teamSize": null,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 2,
      "currentRound": null,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2020-01-23T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 8,
          "round": "Final Round",
          "day": 2,
          "datetime": "2021-01-30T10:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 24,
      "name": "CEO",
      "icon": "./img/24.png",
      "categoryId": 0,
      "category": "non_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "               Create|Express|Organise\n\n        An event designed to bring out the manager within you, C.E.O tests your leadership skills, communication and teamwork through an interesting assortment of tasks.",
      "format": "The event consists of 4 rounds. Only individual registrations are allowed.\n\nRound 1 (Preliminary Round)\n•  This round will be conducted on HackerEarth platform.\n•  Objective type questions based on logical reasoning and the concepts of management.\n•  All participants will receive the same set of questions.\n•  10 participants will be selected to Round 2.\n\nRound 2 (Self Introduction Round)\n•  This round will be conducted through a live meeting in google meet.\n•  Each participant will be provided with a meeting link.\n•  The participants will be asked to do a self-introduction in the time allotted to them. ( Camera and microphone has to be turned on).\n•  6 participants will be selected to Round 3.\n\nRound 3 (Pressure Round)\n•  This round will be conducted through a live meeting in google meet.\n•  Each participant will be provided with a crisis case which they have to resolve.\n•  The solution is to be presented to the judges.\n•  Time allotted for preparation is 1 minute, and 3 minute for presentation.\n•  3 participants will be selected for Round 4.\n \nRound 4 (Product Marketing)\n•  This round will be conducted through a live meeting in google meet.\n•  Each participant will be provided with a product to sell (market).\n• Time allotted for preparation is 1 minute 30 seconds, and 3 minutes to sell the product.\n• 1 winner will be selected by the Judges.\n",
      "rules": "• Organisers reserve all rights to disqualify any team for using unfair means at any stage of the event.\n• In case of any discrepancies, the decision of the coordinators is considered final and binding for all the teams.\n• Additional rules will be provided by the organizers during the conduct of the event.\n• Any violation of the rules provided by the organizers will lead to immediate disqualification.\n• The judges’ decision is final.\n",
      "venue": "HackerEarth/Meet",
      "day": 3,
      "datetime": "2021-01-25T18:00:00",
      "entryFee": null,
      "prizeMoney": 3000,
      "eventHead1Id": 44,
      "eventHead1": {
        "id": 44,
        "name": "Joel Thomas",
        "email": "joelnanthikattu@gmail.com",
        "phoneNumber": "+91 70258 07109"
      },
      "eventHead2Id": 45,
      "eventHead2": {
        "id": 45,
        "name": "Aishwarya Rajkrishnan",
        "email": "aishwaryarajkrishnan2@gmail.com",
        "phoneNumber": "+91 81299 63940"
      },
      "isTeam": false,
      "teamSize": null,
      "eventStatusId": 0,
      "eventStatus": "yet_to_start",
      "numberOfRounds": 5,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-25T18:00:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 13,
          "round": "Self Introduction Round",
          "day": 1,
          "datetime": "2021-01-29T17:00:00"
        },
        {
          "id": 15,
          "round": "Product Marketing Round",
          "day": 3,
          "datetime": "2021-01-31T15:00:00"
        },
        {
          "id": 38,
          "round": "Pressure Round",
          "day": 2,
          "datetime": "2021-01-30T09:00:00"
        }
      ],
      "registration": null
    },
    {
      "id": 5,
      "name": "Extrinsicity",
      "icon": "./img/5.png",
      "categoryId": 2,
      "category": "general_tech",
      "eventTypeId": 1,
      "eventType": "competition",
      "about": "        Extrincisity is a team event, where you analyze, debug and design circuits to satisfy the given specifications within a limited time-frame. Teams will be evaluated on their knowledge of analog electronics with a written test in the first round. In subsequent rounds, they will be tested on their designing prowess, ability to rectify circuits, and the effectiveness of the implementations.\n        So gather your allies, flaunt your designing skills and arrive at brilliant solutions to emerge as the grand victor in this thrilling world of circuit design!\n",
      "format": "Round 1: Preliminary Round \n•  This will be a written test based on analog electronics, circuit design, basic maths and the applications of various analog circuits. The top 10 teams will qualify for the next round.\n\nRound 2: Debug Round \n•  In this round, the teams have to identify, analyse and debug a circuit and make it functional. The top 6 teams will advance to the next round and be provided with a decisive hint for the final round.\n•  Platform: Proteus\n\nRound 3: Design Round  \n•  This round involves designing and implementing a circuit using a software to solve a given problem based on analog electronics. The top 4 teams who arrive at the solution will move on to the next round.\n•  Platform: Proteus\n\nRound 4: Finals\n•  Teams have to combine the hint obtained with the output from the previous round to arrive at a final logo. The team that designs a circuit to attain the exact logo will be declared as winners.\n•  Platform: Proteus\n",
      "rules": "•  This will be a team event with each team having no more than 3 members. \n•  Inter-college teams are allowed. \n•  Decision of the coordinators will be final. \n•  Malpractices and sabotaging other teams in any form will lead to immediate disqualification. \n•  Organisers reserve the right to make decisions in case of conflicts and other issues. \n•  Rules are subject to change at any point of time and it will be explained at the event as well. \n•  Teams violating the above rules will be disqualified immediately. \n•  Excel team will not bear responsibility for internet connection issues or delay caused by participants during the event. \n",
      "venue": "Proteus",
      "day": 3,
      "datetime": "2021-01-31T20:30:00",
      "entryFee": null,
      "prizeMoney": 8000,
      "eventHead1Id": 25,
      "eventHead1": {
        "id": 25,
        "name": "Jubi Cyriac ",
        "email": "jubi.mec@gmail.com",
        "phoneNumber": "+91 82818 58053 "
      },
      "eventHead2Id": 26,
      "eventHead2": {
        "id": 26,
        "name": "Hasna Parveen ",
        "email": "hasnaparveen.mec@gmail.com",
        "phoneNumber": "+91 98955 31295 "
      },
      "isTeam": true,
      "teamSize": 3,
      "eventStatusId": 1,
      "eventStatus": "started",
      "numberOfRounds": 7,
      "currentRound": 0,
      "needRegistration": true,
      "registrationOpen": false,
      "registrationEndDate": "2021-01-20T23:59:00",
      "button": null,
      "registrationLink": null,
      "rounds": [
        {
          "id": 40,
          "round": "Debug Round",
          "day": 3,
          "datetime": "2021-01-31T08:30:00"
        },
        {
          "id": 41,
          "round": "Design Round",
          "day": 3,
          "datetime": "2021-01-31T12:00:00"
        },
        {
          "id": 42,
          "round": "Final Round",
          "day": 3,
          "datetime": "2021-01-31T18:30:00"
        }
      ],
      "registration": null
    }
  ]